
{
  "fullName": "PRANAY DASARI",
  "title": "AI Enthusiast",
  "contact": {
    "phone": "8801645404",
    "email": "dpranaysai2@gmail.com",
    "linkedin": "https://www.linkedin.com/in/pranay-dasari10",
    "city": "Bengaluru"
  },
  "professionalSummary": "Passionate developer with 3+ years of experience building scalable web applications. Specialized in Python, TypeScript, and modern AI-driven development tools. Committed to creating user-centric solutions that bridge technology and human experience.",
  "skills": [
    "Python",
    "TypeScript",
    "Pandas",
    "Numpy",
    "Seaborn",
    "Django",
    "FastAPI",
    "MongoDB",
    "PostgreSQL",
    "XGBoost",
    "Team Leadership",
    "Problem Solving"
  ],
  "workExperience": [
    {
      "jobTitle": "Senior Backend Developer",
      "company": "EverestIMS Technologies Limited",
      "location": "Bengaluru, Karnataka",
      "startDate": "10/2022",
      "endDate": "Present",
      "achievements": [
        "Serving as a Senior Backend Developer in the Enterprise Solutions team, acting as a key interface between product management and end customers to deliver scalable backend features",
        "Led and delivered microservices-based backend projects for multiple enterprise clients with real-time performance and reliability requirements",
        "Designed and implemented custom backend solutions to support customer-specific workflows and complex network infrastructure use cases",
        "Guided and mentored junior developers and QA engineers on system design, testing, and debugging best practices",
        "Collaborated closely with product teams to prioritize customer requirements, manage sprints, and drive project delivery",
        "Handled multiple enterprise-level deployments simultaneously, ensuring timely delivery and post-deployment support"
      ]
    },
    {
      "jobTitle": "Python Developer",
      "company": "Adaptive Learning Solutions",
      "location": "Remote",
      "startDate": "07/2021",
      "endDate": "10/2022",
      "achievements": [
        "Worked as a Junior Python Developer, supporting backend feature development and debugging issues in production systems",
        "Troubleshot and fixed bugs across multiple components, gaining practical exposure to production environments and deployment pipelines",
        "Learned how educational product ecosystems function at scale, and contributed to team discussions around product logic and modular design",
        "Collaborated with senior developers and gained hands-on experience working in agile software teams",
        "Maintained legacy components and contributed to gradual modernization of the platform's architecture"
      ]
    }
  ],
  "certifications": [
    {
      "name": "Google Gen AI",
      "date": "11/2022"
    }
  ],
  "projects": [
    {
      "name": "Infraon - AIOps",
      "description": "AIOps is an AI-powered IT operations platform designed to deliver predictive alerts and advanced analytics across enterprise infrastructures. As a Senior Backend Developer in the Enterprise Solutions team, I led backend development for dashboards, reporting modules, and alert prediction engines. The platform integrates forecasting models like Facebook Prophet and XGBoost to process time-series data, enabling anomaly detection and resource optimization. I also contributed to stream processing and message queuing for real-time telemetry ingestion.",
      "technologies": ["Python", "MongoDB", "PostgreSQL", "RabbitMQ", "Kafka", "XGBoost", "Facebook Prophet", "Redis", "WebSocket"],
      "outcomes": "Delivered intelligent observability tools adopted by major Indian enterprises, resulting in a 35% improvement in operational incident response times"
    },
    {
      "name": "Infraon - IPAM (IP Address Management)",
      "description": "Infraon's IPAM system is a centralized solution to manage and allocate IP addresses, subnets, and associated network infrastructure. I worked as a Senior Developer responsible for designing and maintaining hierarchical IP address management structures that support enterprise-scale deployments. I implemented automation features for IP allocation, ensured compliance with organizational policies, and integrated audit trails and reporting. The platform is used by government and defense organizations such as ISRO for secure and traceable network resource tracking.",
      "technologies": ["Python", "MongoDB", "PostgreSQL", "RabbitMQ", "Kafka", "Redis", "WebSocket"],
      "outcomes": "Deployed across organizations like ISRO, enabling structured IP governance and reducing configuration errors by 25%"
    },
    {
      "name": "Infraon - Network Management Systems (NMS)",
      "description": "Infraon's NMS is a real-time monitoring and alerting platform for enterprise networks. In my role as a Senior Backend Developer in the Enterprise Solutions team, I built core backend services for tracking device health, generating alerts, and processing SNMP/telemetry data. I worked closely with customers to customize NMS for their environments and mentored two engineers in backend development and testing. The system provides visual dashboards and automated responses for improved uptime and faster issue resolution.",
      "technologies": ["Python", "MongoDB", "PostgreSQL", "RabbitMQ", "Kafka", "Redis", "WebSocket"],
      "outcomes": "Enabled real-time network monitoring for Indian enterprise clients, improving uptime and reducing troubleshooting time by up to 30%"
    },
    {
      "name": "Adaptive Learning Solutions - Educational Platform",
      "description": "An interactive platform aimed at delivering personalized learning content using adaptive learning paths. As a Junior Python Developer, I contributed to backend APIs, fixed performance bottlenecks, and built features to support course recommendation and progress tracking. My work helped align learning outcomes with user interaction data while maintaining high code quality and stability.",
      "technologies": ["Python", "Flask", "MySQL"],
      "outcomes": "Contributed to system enhancements that improved learning module efficiency and increased student engagement by 15%"
    }
  ],
  "additionalSections": {
    "languages": [
      "English (Fluent)",
      "Hindi (Fluent)",
      "Telugu (Native)",
      "Kannada (Conversational)",
      "Tamil (Conversational)"
    ],
    "volunteerWork": [
      "Volunteer developer at People + AI organization, co-developed Sukoon: An AI-enabled ecosystem for bridging India's mental health support gaps",
      "Led the technical development of the platform from scratch, focusing on accessibility, predictive mental health insights, and AI-driven resource allocation",
      "Collaborated with domain experts to integrate data-driven tools for improving mental health support across underserved communities"
    ],
    "publications": []
  }
}
